app/Models/ModelPenjualan.php

    public function CekProduk($kode_produk)
    {
        return $this->db->table('tbl_produk')
        ->join('tbl_kategori', 'tbl_kategori.id_kategori=tbl_produk.id_kategori')
        ->join('tbl_satuan','tbl_satuan.id_satuan=tbl_produk.id_satuan')
        ->where('kode_produk',$kode_produk)
        ->get()
        ->getRowArray();
---
SELECT *
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_produk`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan`=`tbl_produk`.`id_satuan`
WHERE `kode_produk` = '89778667433'

    public function AllProduk()
    {
        return $this->db->table('tbl_produk')
        ->join('tbl_kategori', 'tbl_kategori.id_kategori=tbl_produk.id_kategori')
        ->join('tbl_satuan','tbl_satuan.id_satuan=tbl_produk.id_satuan')
        ->where('stok > 0')
        ->get()
        ->getResultArray();
---
SELECT *
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_produk`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan`=`tbl_produk`.`id_satuan`
WHERE `stok` >0

    public function InsertJual($data)
    {
        $this->db->table('tbl_jual')->insert($data);
---
INSERT INTO `tbl_jual` (`no_faktur`, `tgl_jual`, `jam`, `grand_total`, `dibayar`, `kembalian`, `id_user`) VALUES ('202402280001', '2024-02-28', '07:35:58', 143000, '150000', '7000', NULL)

    public function InsertRinciJual($data)
    {
        $this->db->table('tbl_rinci')->insert($data);
---
INSERT INTO `tbl_rinci` (`no_faktur`, `kode_produk`, `modal`, `harga`, `qty`, `total_harga`, `untung`) VALUES ('202402280001', '12233445', '120000', 130000, 1, 130000, 10000)