app/Models/ModelUser.php

SELECT *
FROM `tbl_user`
WHERE `email` = 'admin@gmail.com'
AND `password` = '40bd001563085fc35165329ea1ff5c5ecbdbbeef'
---
   public function loginUser($email, $password)
   {
       return $this->db->table('tbl_user')
           ->where([
               'email' => $email,
               'password' => $password,
           ])->get()->getRowArray();